<a href="https://colab.research.google.com/github/sagarbhadra7/Python-Programs/blob/master/Loan_prediction.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np
import math
import matplotlib.pyplot as plt
import seaborn as sns
import os
from sklearn.impute import SimpleImputer as Imuter

In [0]:
train_path="C:\\Users\\sagar\\Downloads\\Hackathon\\Loan_prediction\\train.csv"
test_path="C:\\Users\\sagar\\Downloads\\Hackathon\\Loan_prediction\\test.csv"
X=pd.read_csv(train_path)
y=pd.read_csv(test_path)

In [0]:
X.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [0]:
y.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

In [0]:
X.describe()

,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History
count,614.000000,614.000000,592.000000,600.00000,564.000000
mean,5403.459283,1621.245798,146.412162,342.00000,0.842199
std,6109.041673,2926.248369,85.587325,65.12041,0.364878
min,150.000000,0.000000,9.000000,12.00000,0.000000
25%,2877.500000,0.000000,100.000000,360.00000,1.000000
50%,3812.500000,1188.500000,128.000000,360.00000,1.000000
75%,5795.000000,2297.250000,168.000000,360.00000,1.000000
max,81000.000000,41667.000000,700.000000,480.00000,1.000000

In [0]:
X.isnull().sum()

Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [0]:
y.isnull().sum()

Loan_ID               0
Gender               11
Married               0
Dependents           10
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            5
Loan_Amount_Term      6
Credit_History       29
Property_Area         0
dtype: int64

In [0]:
X.dtypes

Loan_ID               object
Gender                object
Married               object
Dependents            object
Education             object
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
Loan_Status           object
dtype: object

In [0]:
X.shape

(614, 13)

In [0]:
X_gender=pd.get_dummies(X['Gender'])
X_married=pd.get_dummies(X['Married'])
X_education=pd.get_dummies(X['Education'])
X_Self_Employed=pd.get_dummies(X['Self_Employed'])
X_Property_Area=pd.get_dummies(X['Property_Area'])

In [0]:
X_Property_Area

     Rural  Semiurban  Urban
0        0          0      1
1        1          0      0
2        0          0      1
3        0          0      1
4        0          0      1
..     ...        ...    ...
609      1          0      0
610      1          0      0
611      0          0      1
612      0          0      1
613      0          1      0

[614 rows x 3 columns]

In [0]:
frames=[X_Self_Employed,X_Property_Area]
X_new=pd.concat(frames)

In [0]:
X_new

      No  Yes  Rural  Semiurban  Urban
0    1.0  0.0    NaN        NaN    NaN
1    1.0  0.0    NaN        NaN    NaN
2    0.0  1.0    NaN        NaN    NaN
3    1.0  0.0    NaN        NaN    NaN
4    1.0  0.0    NaN        NaN    NaN
..   ...  ...    ...        ...    ...
609  NaN  NaN    1.0        0.0    0.0
610  NaN  NaN    1.0        0.0    0.0
611  NaN  NaN    0.0        0.0    1.0
612  NaN  NaN    0.0        0.0    1.0
613  NaN  NaN    0.0        1.0    0.0

[1228 rows x 5 columns]